avnet-iotconnect/iotc-stm32-n6-demos/Projects/multi_pose_estimation/Src/app.c
  convert_point(to->x, to->y, &x1, &y1);
  is_clamp = clamp_point(&x1, &y1);
  if (is_clamp)
    return ;

  UTIL_LCD_DrawLine(x0, y0, x1, y1, color);
  for (i = 1; i <= (BINDING_WIDTH - 1) / 2; i++) {
    if (abs(y1 - y0) > abs(x1 - x0)) {
      Display_binding_line(x0 + i, y0, x1 + i , y1, color);
      Display_binding_line(x0 - i, y0, x1 - i , y1, color);
    } else {
      Display_binding_line(x0, y0 + i, x1 , y1 + i, color);
      Display_binding_line(x0, y0 - i, x1 , y1 - i, color);
    }
  }
}

static void Display_Detection(mpe_pp_outBuffer_t *detect)
{
  int xc, yc;
  int x0, y0;
  int x1, y1;
  int w, h;
  int i;

  convert_point(detect->x_center, detect->y_center, &xc, &yc);
  convert_length(detect->width, detect->height, &w, &h);
  x0 = xc - (w + 1) / 2;
  y0 = yc - (h + 1) / 2;
  x1 = xc + (w + 1) / 2;
  y1 = yc + (h + 1) / 2;
  clamp_point(&x0, &y0);
  clamp_point(&x1, &y1);

  UTIL_LCD_DrawRect(x0, y0, x1 - x0, y1 - y0, colors[detect->class_index % NUMBER_COLORS]);
  UTIL_LCDEx_PrintfAt(x0, y0, LEFT_MODE, classes_table[detect->class_index]);

  for (i = 0; i < ARRAY_NB(bindings); i++)
    Display_binding(&detect->pKeyPoints[bindings[i][0]], &detect->pKeyPoints[bindings[i][1]], bindings[i][2]);
  for (i = 0; i < AI_POSE_PP_POSE_KEYPOINTS_NB; i++) {
	Display_keypoint(&detect->pKeyPoints[i], kp_color[i], NULL, NULL);
  }
}

static void Display_Detection_obj0(mpe_pp_outBuffer_t *detect)
{
  int xc, yc;
  int x0, y0;
  int x1, y1;
  int w, h;
  int i;

  convert_point(detect->x_center, detect->y_center, &xc, &yc);
  convert_length(detect->width, detect->height, &w, &h);
  x0 = xc - (w + 1) / 2;
  y0 = yc - (h + 1) / 2;
  x1 = xc + (w + 1) / 2;
  y1 = yc + (h + 1) / 2;
  clamp_point(&x0, &y0);
  clamp_point(&x1, &y1);

  UTIL_LCD_DrawRect(x0, y0, x1 - x0, y1 - y0, colors[detect->class_index % NUMBER_COLORS]);
  UTIL_LCDEx_PrintfAt(x0, y0, LEFT_MODE, classes_table[detect->class_index]);

  for (i = 0; i < ARRAY_NB(bindings); i++)
    Display_binding(&detect->pKeyPoints[bindings[i][0]], &detect->pKeyPoints[bindings[i][1]], bindings[i][2]);
  for (i = 0; i < AI_POSE_PP_POSE_KEYPOINTS_NB; i++) {
    if (i > 3) {
      Display_keypoint(&detect->pKeyPoints[i], kp_color[i], NULL, NULL);
	} else {
	  Display_keypoint(&detect->pKeyPoints[i], kp_color[i], &obj0_x[i], &obj0_y[i]);
	  obj0_color[i] = kp_color[i];
	}
  }
}

static void Display_Detection_obj1(mpe_pp_outBuffer_t *detect)
{
  int xc, yc;
  int x0, y0;
  int x1, y1;
  int w, h;
  int i;

  convert_point(detect->x_center, detect->y_center, &xc, &yc);
  convert_length(detect->width, detect->height, &w, &h);
  x0 = xc - (w + 1) / 2;
  y0 = yc - (h + 1) / 2;
  x1 = xc + (w + 1) / 2;
  y1 = yc + (h + 1) / 2;
  clamp_point(&x0, &y0);
  clamp_point(&x1, &y1);

  UTIL_LCD_DrawRect(x0, y0, x1 - x0, y1 - y0, colors[detect->class_index % NUMBER_COLORS]);
  UTIL_LCDEx_PrintfAt(x0, y0, LEFT_MODE, classes_table[detect->class_index]);

  for (i = 0; i < ARRAY_NB(bindings); i++)
    Display_binding(&detect->pKeyPoints[bindings[i][0]], &detect->pKeyPoints[bindings[i][1]], bindings[i][2]);
  for (i = 0; i < AI_POSE_PP_POSE_KEYPOINTS_NB; i++) {
    if (i > 3) {
      Display_keypoint(&detect->pKeyPoints[i], kp_color[i], NULL, NULL);
	} else {
	  Display_keypoint(&detect->pKeyPoints[i], kp_color[i], &obj1_x[i], &obj1_y[i]);
	  obj1_color[i] = kp_color[i];
	}
  }
}

static void Display_NetworkOutput(display_info_t *info)
{
  mpe_pp_outBuffer_t *rois = info->detects;
  uint32_t nb_rois = info->nb_detect;
  float cpu_load_one_second;
  int line_nb = 0;
  float nn_fps;
  int i;

  /* clear previous ui */
  UTIL_LCD_FillRect(lcd_fg_area.X0, lcd_fg_area.Y0, lcd_fg_area.XSize, lcd_fg_area.YSize, 0x00000000); /* Clear previous boxes */

  /* cpu load */
  cpuload_update(&cpu_load);
  cpuload_get_info(&cpu_load, NULL, &cpu_load_one_second, NULL);

  /* draw metrics */
  nn_fps = 1000.0 / info->nn_period_ms;
#if 1
  UTIL_LCDEx_PrintfAt(0, LINE(line_nb),  RIGHT_MODE, "Cpu load");
  line_nb += 1;
  UTIL_LCDEx_PrintfAt(0, LINE(line_nb),  RIGHT_MODE, "   %.1f%%", cpu_load_one_second);
  line_nb += 2;
  UTIL_LCDEx_PrintfAt(0, LINE(line_nb), RIGHT_MODE, "Inference");
  line_nb += 1;
  UTIL_LCDEx_PrintfAt(0, LINE(line_nb), RIGHT_MODE, "   %ums", info->inf_ms);
  line_nb += 2;
  UTIL_LCDEx_PrintfAt(0, LINE(line_nb), RIGHT_MODE, "   FPS");
  line_nb += 1;
  UTIL_LCDEx_PrintfAt(0, LINE(line_nb), RIGHT_MODE, "  %.2f", nn_fps);
  line_nb += 2;
  UTIL_LCDEx_PrintfAt(0, LINE(line_nb), RIGHT_MODE, " Objects %u", nb_rois);
  line_nb += 1;
#else
  (void) nn_fps;
  UTIL_LCDEx_PrintfAt(0, LINE(line_nb),  RIGHT_MODE, "Cpu load");
  line_nb += 1;
  UTIL_LCDEx_PrintfAt(0, LINE(line_nb),  RIGHT_MODE, "   %.1f%%", cpu_load_one_second);
  line_nb += 1;
  UTIL_LCDEx_PrintfAt(0, LINE(line_nb), RIGHT_MODE, "nn period");
  line_nb += 1;
  UTIL_LCDEx_PrintfAt(0, LINE(line_nb), RIGHT_MODE, "   %ums", info->nn_period_ms);
  line_nb += 1;
  UTIL_LCDEx_PrintfAt(0, LINE(line_nb), RIGHT_MODE, "Inference");
  line_nb += 1;
  UTIL_LCDEx_PrintfAt(0, LINE(line_nb), RIGHT_MODE, "   %ums", info->inf_ms);
  line_nb += 1;
  UTIL_LCDEx_PrintfAt(0, LINE(line_nb), RIGHT_MODE, "Post process");
  line_nb += 1;
  UTIL_LCDEx_PrintfAt(0, LINE(line_nb), RIGHT_MODE, "   %ums", info->pp_ms);
  line_nb += 1;
  UTIL_LCDEx_PrintfAt(0, LINE(line_nb), RIGHT_MODE, "Display");
  line_nb += 1;
  UTIL_LCDEx_PrintfAt(0, LINE(line_nb), RIGHT_MODE, "   %ums", info->disp_ms);
  line_nb += 1;
  UTIL_LCDEx_PrintfAt(0, LINE(line_nb), RIGHT_MODE, " Objects %u", nb_rois);
  line_nb += 1;
#endif

  //initialize the object names
  strcpy(object0_name, "");
  strcpy(object1_name, "");

  /* Draw bounding boxes */
  for (i = 0; i < nb_rois; i++) {
    //IOTCONNECT, report rois[0]
    if (i == 0) {
      Display_Detection_obj0(&rois[i]);
      mpe_pp_outBuffer_t *detect_obj = &rois[i];
      if (sizeof(classes_table[detect_obj->class_index]) < 30) {
        strcpy(object0_name, classes_table[detect_obj->class_index]);
      } else {
  	    strcpy(object0_name, "");
      }
    }
    //IOTCONNECT, report rois[1]
    else if (i == 1) {
      Display_Detection_obj1(&rois[i]);
      mpe_pp_outBuffer_t *detect_obj1 = &rois[i];
      if (sizeof(classes_table[detect_obj1->class_index]) < 30) {
        strcpy(object1_name, classes_table[detect_obj1->class_index]);
      } else {
  	    strcpy(object1_name, "");
      }
    }
    else {
      Display_Detection(&rois[i]);
    }
  }
  uint32_t current_time = HAL_GetTick();
  if ((current_time - last_send_time) < IOTC_INTERVAL) {
    return;
  }
  last_send_time = current_time;

  //only object0 is present
  if (strlen(object0_name) != 0 && strlen(object1_name) == 0) {
    da16k_at_send_formatted_raw_no_crlf("AT+NWICMSG nb_detect,%d,object0_name,%s,FPS,%.1f,cpu_load,%.1f\r\n", nb_rois, object0_name, nn_fps, cpu_load_one_second);
    tx_thread_sleep(100);

    //sending the coordinates of object0
    if ( !((obj0_x[0] == 0 && obj0_y[0] == 0) || (obj0_x[1] == 0 && obj0_y[1] == 0) || (obj0_x[2] == 0 && obj0_y[2] == 0)) ) {
      for (int i = 0; i < 4; i++) {
        convert_color_to_str(obj0_color[i], &obj0_color_str[i][0]);
      }
      da16k_at_send_formatted_raw_no_crlf("AT+NWICMSG obj0_x1,%d,obj0_y1,%d,obj0_color1,%s,obj0_x2,%d,obj0_y2,%d,obj0_color2,%s\r\n",
      	  										   obj0_x[0], obj0_y[0], &obj0_color_str[0][0], obj0_x[1], obj0_y[1], &obj0_color_str[1][0]);
      tx_thread_sleep(100);
      da16k_at_send_formatted_raw_no_crlf("AT+NWICMSG obj0_x3,%d,obj0_y3,%d,obj0_color3,%s,obj0_x4,%d,obj0_y4,%d,obj0_color4,%s\r\n",
            	  										   obj0_x[2], obj0_y[2], &obj0_color_str[2][0], obj0_x[3], obj0_y[3], &obj0_color_str[3][0]);
    }
  }

