avnet-iotconnect/iotc-stm32-n6-demos/Projects/multi_pose_estimation/Src/app.c
  //object0 and object1 are present
  else if (strlen(object0_name) != 0 && strlen(object1_name) != 0) {
	da16k_at_send_formatted_raw_no_crlf("AT+NWICMSG nb_detect,%d,object0_name,%s,object1_name,%s,FPS,%.1f,cpu_load,%.1f\r\n", nb_rois, object0_name, object1_name, nn_fps, cpu_load_one_second);
	tx_thread_sleep(100);

	//sending the coordinates of object0
    if ( !((obj0_x[0] == 0 && obj0_y[0] == 0) || (obj0_x[1] == 0 && obj0_y[1] == 0) || (obj0_x[2] == 0 && obj0_y[2] == 0)) ) {
      for (int i = 0; i < 4; i++) {
        convert_color_to_str(obj0_color[i], &obj0_color_str[i][0]);
      }
      da16k_at_send_formatted_raw_no_crlf("AT+NWICMSG obj0_x1,%d,obj0_y1,%d,obj0_color1,%s,obj0_x2,%d,obj0_y2,%d,obj0_color2,%s\r\n",
      	  										   obj0_x[0], obj0_y[0], &obj0_color_str[0][0], obj0_x[1], obj0_y[1], &obj0_color_str[1][0]);
      tx_thread_sleep(100);
      da16k_at_send_formatted_raw_no_crlf("AT+NWICMSG obj0_x3,%d,obj0_y3,%d,obj0_color3,%s,obj0_x4,%d,obj0_y4,%d,obj0_color4,%s\r\n",
            	  										   obj0_x[2], obj0_y[2], &obj0_color_str[2][0], obj0_x[3], obj0_y[3], &obj0_color_str[3][0]);
    }

    //sending the coordinates of object1
    if ( !((obj1_x[0] == 0 && obj1_y[0] == 0) || (obj1_x[1] == 0 && obj1_y[1] == 0) || (obj1_x[2] == 0 && obj1_y[2] == 0)) ) {
      for (int i = 0; i < 4; i++) {
        convert_color_to_str(obj1_color[i], &obj1_color_str[i][0]);
      }
      tx_thread_sleep(100);
      da16k_at_send_formatted_raw_no_crlf("AT+NWICMSG obj1_x1,%d,obj1_y1,%d,obj1_color1,%s,obj1_x2,%d,obj1_y2,%d,obj1_color2,%s\r\n",
      	  										   obj1_x[0], obj1_y[0], &obj1_color_str[0][0], obj1_x[1], obj1_y[1], &obj1_color_str[1][0]);
      tx_thread_sleep(100);
      da16k_at_send_formatted_raw_no_crlf("AT+NWICMSG obj1_x3,%d,obj1_y3,%d,obj1_color3,%s,obj1_x4,%d,obj1_y4,%d,obj1_color4,%s\r\n",
            	  										   obj1_x[2], obj1_y[2], &obj1_color_str[2][0], obj1_x[3], obj1_y[3], &obj1_color_str[3][0]);
    }
  }

  //IOTCONNECT to receive C2D message
  da16k_cmd_t current_cmd = {0};
  if ((da16k_get_cmd(&current_cmd) == DA16K_SUCCESS) && current_cmd.command) {
    //USE current_cmd.command & current_cmd.parameters here
	printf("/IOTCONNECT command is %s\r\n",current_cmd.command);
	if (current_cmd.parameters) {
	  printf("/IOTCONNECT command->parameter is %s\r\n",current_cmd.parameters);
	  da16k_at_send_formatted_raw_no_crlf("AT+NWICMSG iotc_cmd,%s,iotc_cmd_parameter,%s\r\n", current_cmd.command, current_cmd.parameters);
	}
    da16k_destroy_cmd(current_cmd);
  }
}

static void nn_thread_fct(ULONG arg)
{
  const LL_Buffer_InfoTypeDef *nn_out_info = LL_ATON_Output_Buffers_Info_Default();
  const LL_Buffer_InfoTypeDef *nn_in_info = LL_ATON_Input_Buffers_Info_Default();
  uint32_t nn_period_ms;
  uint32_t nn_period[2];
  uint8_t *nn_pipe_dst;
  uint32_t nn_out_len;
  uint32_t nn_in_len;
  uint32_t inf_ms;
  uint32_t ts;
  int ret;

  /* setup buffers size */
  nn_in_len = LL_Buffer_len(&nn_in_info[0]);
  nn_out_len = LL_Buffer_len(&nn_out_info[0]);
  //printf("nn_out_len = %d\n", nn_out_len);
  assert(nn_out_len == NN_BUFFER_OUT_SIZE);

  /*** App Loop ***************************************************************/
  nn_period[1] = HAL_GetTick();

  nn_pipe_dst = bqueue_get_free(&nn_input_queue, 0);
  assert(nn_pipe_dst);
  CAM_NNPipe_Start(nn_pipe_dst, CMW_MODE_CONTINUOUS);
  while (1)
  {
    uint8_t *capture_buffer;
    uint8_t *output_buffer;

    nn_period[0] = nn_period[1];
    nn_period[1] = HAL_GetTick();
    nn_period_ms = nn_period[1] - nn_period[0];

    capture_buffer = bqueue_get_ready(&nn_input_queue);
    assert(capture_buffer);
    output_buffer = bqueue_get_free(&nn_output_queue, 1);
    assert(output_buffer);

    /* run ATON inference */
    ts = HAL_GetTick();
     /* Note that we don't need to clean/invalidate those input buffers since they are only access in hardware */
    ret = LL_ATON_Set_User_Input_Buffer_Default(0, capture_buffer, nn_in_len);
    assert(ret == LL_ATON_User_IO_NOERROR);
     /* Invalidate output buffer before Hw access it */
    CACHE_OP(SCB_InvalidateDCache_by_Addr(output_buffer, nn_out_len));
    ret = LL_ATON_Set_User_Output_Buffer_Default(0, output_buffer, nn_out_len);
    assert(ret == LL_ATON_User_IO_NOERROR);
    LL_ATON_RT_Main(&NN_Instance_Default);
    inf_ms = HAL_GetTick() - ts;

    /* release buffers */
    bqueue_put_free(&nn_input_queue);
    bqueue_put_ready(&nn_output_queue);

    /* update display stats */
    tx_mutex_get(&disp.lock, TX_WAIT_FOREVER);
    disp.info.inf_ms = inf_ms;
    disp.info.nn_period_ms = nn_period_ms;
    tx_mutex_put(&disp.lock);
  }
}

static void pp_thread_fct(ULONG arg)
{
#if POSTPROCESS_TYPE == POSTPROCESS_OD_YOLO_V2_UF
  yolov2_pp_static_param_t pp_params;
#elif POSTPROCESS_TYPE == POSTPROCESS_OD_YOLO_V5_UU
  yolov5_pp_static_param_t pp_params;
#elif POSTPROCESS_TYPE == POSTPROCESS_OD_YOLO_V8_UF || POSTPROCESS_TYPE == POSTPROCESS_OD_YOLO_V8_UI
  yolov8_pp_static_param_t pp_params;
#elif POSTPROCESS_TYPE == POSTPROCESS_POSE_YOLO_V8_UF
  yolov8_pose_pp_static_param_t pp_params;
#elif POSTPROCESS_TYPE == POSTPROCESS_MPE_YOLO_V8_UF
  mpe_yolov8_pp_static_param_t pp_params;
#else
    #error "PostProcessing type not supported"
#endif
#if POSTPROCESS_TYPE == POSTPROCESS_MPE_YOLO_V8_UF
  mpe_pp_out_t pp_output;
#else
  postprocess_out_t pp_output;
#endif
  uint32_t nn_pp[2];
  void *pp_input;
  int ret;
  int i;

  /* setup post process */
  app_postprocess_init(&pp_params);
  while (1)
  {
    uint8_t *output_buffer;

    output_buffer = bqueue_get_ready(&nn_output_queue);
    assert(output_buffer);
    pp_input = (void *) output_buffer;
    pp_output.pOutBuff = NULL;

    nn_pp[0] = HAL_GetTick();
    ret = app_postprocess_run((void * []){pp_input}, 1, &pp_output, &pp_params);
    assert(ret == 0);
    nn_pp[1] = HAL_GetTick();

    /* update display stats and detection info */
    tx_mutex_get(&disp.lock, TX_WAIT_FOREVER);
    disp.info.nb_detect = pp_output.nb_detect;
    for (i = 0; i < pp_output.nb_detect; i++)
      disp.info.detects[i] = pp_output.pOutBuff[i];
    disp.info.pp_ms = nn_pp[1] - nn_pp[0];
    tx_mutex_put(&disp.lock);

    bqueue_put_free(&nn_output_queue);
    tx_semaphore_ceiling_put(&disp.update, 1);
  }
}

static void dp_update_drawing_area()
{
  int ret;

  __disable_irq();
  ret = HAL_LTDC_SetAddress_NoReload(&hlcd_ltdc, (uint32_t) lcd_fg_buffer[lcd_fg_buffer_rd_idx], LTDC_LAYER_2);
  assert(ret == HAL_OK);
  __enable_irq();
}

